app/Controllers/Dosen.php

    public function list()
    {
        $data = [
            'data'  => $this->dosen->paginate('10', 'dosen'),
            'title' => 'List Dosen',
            'pager' => $this->dosen->pager,
        ];
---
SELECT *
FROM `dosen`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `dosen`